[
  {
    "id": 1605830400,
    "title": "My Second Post",
    "author": "Alejandro Perdomo",
    "date": "November 20, 2020",
    "desc": "This is the second post description",
    "img": "19BPYvJYARaOOvXXav1MWamPuW2ohyqvn",
    "content": "# Spring-boot-restapi\n\nI have used this project as a fun way of learning Spring Boot during these Coronavirus Days, it is not mean to be used for anything at all, is just an academic project for learning purposes. This is an Restful API which is created to manage a group of clients in a Front-End application, in my case, I used Angular but this is totally irrelevant as a project limitation since a Restful API is being used.\n\n## Getting Started\n\nIn case you want to try this project, feel free to download it and remember to give me a little credit if you use it professionally.\n\n### Prerequisites\n\nThe whole application is build using Java and Spring Boot as a framework, you will need a JDK (preferably 1.8, this is the one I used) and as an interface to manage relational data JPA, as you might be thinking now, you need and enviromment where you can create a MySQL db to connect with this Restful API.\n\nAs soon as you clone the repo and try to run it using IntelliJ (seriously, I recommend using this IDE) you will notice file \"application.properties\" and some other important files are missing, this is because at those files there is some stuff i didn't want to share and I added them to my .gitignore, you can check this file to know which files are left to add in case you want to get a successful run. \n\nHere you can see an example of how file \"application.properties\" should be in order to run the application properly:\n\nAs you can see, in this file all you have to do is setting the database resource and adding some configuration params to make possible some stuff as uploading a large image to the backend and using JPA to manage your persistent data. You really want to let parameters as \"logging.level.org.hibernate.SQL=debug\" to know what is JPA doing behind the scenes at server reload and \"spring.jpa.hibernate.ddl-auto=create-drop\" to run, everytime this happens, a SQL script which is supposed to fill our database with dummy data. This SQL script is located on /src/main/resources/import.sql \n\nOnce everything has been set up successfully, you can use Postman to make your own requests.\n\n## Built With\n\n* [Spring Boot](https://spring.io/projects/spring-boot) - The Java framework used\n* [Maven](https://maven.apache.org/) - Dependency Management\n* [Tomcat](http://tomcat.apache.org/) - As a development server\n* [MySQL](https://www.mysql.com/) - As relational database\n* [OpenSSL](https://www.openssl.org/) - As a tool for generating RSA keys.\n\n## Authors\n\n* **Alejandro Perdomo** - [Apergot](https://github.com/Apergot)\n\n## License\n\nThis project has NO LICENSE, so, the work is under exclusive copyright by default."
  },
  {
    "id": 1605571200,
    "title": "My First Post",
    "author": "Alejandro Perdomo",
    "date": "November 17, 2020",
    "desc": "This is the first post description",
    "img": "19BPYvJYARaOOvXXav1MWamPuW2ohyqvn",
    "content": "\n# Sports events web\n\nThis project consists of to create an admin dashboard using Angular in Frontend and Java Spring Boot in Backend\n\n## Build with 🛠️\n\n* [Angular](https://angular.io) - A platform for building mobile and desktop web applications.\n* [IntelliJ IDEA](https://www.jetbrains.com/idea) - An integrated development environment (IDE) written in Java for developing computer software.\n* [Sourcetree](https://www.sourcetreeapp.com) - Simplicity and power in a beautiful Git GUI.\n* [Spring Boot](https://spring.io) - An open source Java-based framework.\n* [Villanuevand](https://github.com/Villanuevand) - **Andrés Villanueva** - README template.\n* [Visual Studio Code](https://code.visualstudio.com/) - A source code editor that can be used with a variety of programming languages.\n\n## Authors ✒️\n\n* **Alejandro Perdomo González** - *-* - [Apergot](https://github.com/Apergot)\n* **Diego Gustavo Hawkins Vargas** - *-* - [DiegoHawkins](https://github.com/DiegoHawkins)\n* **Juan Kevin Trujillo Rodríguez** - *-* - [juankevinTR](https://juankevintrujillo.com)\n* **Miguel Ángel Berciano Rodríguez** - *-* - [MiguelBerciano](https://github.com/MiguelBerciano)\n\n## License 📄\n\nThis project has NO LICENSE, so, the work is under exclusive copyright by default."
  }
]
